IDEA StatiCa Open Model
CrossSectionFactory.FillColdFormedSigma Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Fill parameters for cold formed sigma section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillColdFormedSigma(
	CrossSectionParameter css,
	double Height,
	double Width,
	double Lip,
	double Thickness,
	double InsideRadius,
	double HeightMiddle,
	double HeightEdge,
	double Depth
)
Public Shared Sub FillColdFormedSigma (
	css As CrossSectionParameter,
	Height As Double,
	Width As Double,
	Lip As Double,
	Thickness As Double,
	InsideRadius As Double,
	HeightMiddle As Double,
	HeightEdge As Double,
	Depth As Double
)
public:
static void FillColdFormedSigma(
	CrossSectionParameter^ css,
	double Height,
	double Width,
	double Lip,
	double Thickness,
	double InsideRadius,
	double HeightMiddle,
	double HeightEdge,
	double Depth
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Height
Type: System.Double
Height
Width
Type: System.Double
Width
Lip
Type: System.Double
Length of lip
Thickness
Type: System.Double
Thickness
InsideRadius
Type: System.Double
Inside radius
HeightMiddle
Type: System.Double
Height of middle part
HeightEdge
Type: System.Double
Height of edge part
Depth
Type: System.Double
Depth of web-fold
Remarks
Dimension of cold formed sigma section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 12;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Height = 0.20;
double Width = 0.15;
double Lip = 0.02;
double Thickness = 0.005;
double InsideRadius = 0.010;
double HeightMiddle = 0.10;
double HeightEdge = 0.035;
double Depth = 0.035;
CrossSectionFactory.FillColdFormedSigma(css, Height, Width, Lip, Thickness, InsideRadius, HeightMiddle, HeightEdge, Depth);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace